{
  "i18n": {
    "nav": {
      "home": "Inicio",
      "team": "Equipo",
      "production": "Producción",
      "game": "Juego",
      "engine": "Motor",
      "post_mortem": "Post Mortem",
      "contact": "Contacto",
      "download": "Descargar"
    },
    "home": {
      "headline": "Dune: Fremen's Rising",
      "catchphrase": "Dune: Fremen’s Rising es un videojuego RTT con cámara en perspectiva basado en la archiconocida IP de Dune. Este juego de acción táctica con múltiples personajes narra la breve historia de como Paul Atreides, tiempo después de morir su padre y sus aliados de la casa Atreides, vive un asedio Harkonen a las puertas de su nuevo hogar, en el que ha sido acogido por los Fremen.",
      "catchphrasetwo": "En Dune: Fremen’s Rising cada uno de nuestros protagonistas tiene su propio set de habilidades para combatir contra el ejército Harkonnen y abrirse paso por los distintos escenarios hasta llegar a Rabban Harkonen, uno de los principales responsables de la muerte de Leto, el padre de Paul.",
      "downloadText": "Descargar el juego",
      "card1": {
        "text": "Paul Atreides: Paul Atreides es el heredero de la antes gloriosa Casa Atreides de Caladan. Su padre y gran parte de la gente que formaba parte de su vida ha muerto, y ahora vive exiliado en el desierto junto a su madre, Lady Jessica Atreides, acogidos por los Fremen, una tribu nómada del desierto nativa de Arrakis. Paul aún es joven e inexperto, y está aprendiendo a usar sus habilidades, aunque a veces es impulsivo y temerario, su entrenamiento lo convierte en un rival peligroso al que enfrentarse."
      },
      "card2": {
        "text": "Chani Kynes: Chani Kynes, hija del fallecido Astrónomo de Arrakis Liet Kynes, vive de forma nómada con los Fremen desde niña, la vida en el desierto la ha convertido en la mujer fuerte y decidida que es hoy. Pese a su carácter parcialmente borde se esconde un alma sensible que se escuda en toda clase de recursos y armas de gran letalidad, lo que la convierte en una asesina implacable."
      },
      "card3": {
        "text": "Stilgar: Stilgar fué antaño un líder político de Arrakeen que bajo el mandato de los Harkonnen fué relegado al exilio con su tribu a vivir en el desierto. Stilgar es un experto militar diestro en el combate cuerpo a cuerpo y a distancia, además de un gran conocedor de las costumbres y la historia de Arrakis. Su sabiduría y experiencia lo convierten en un valuarte crucial para la defensa de los Fremen frente a la Casa Harkonnen, es un hombre preparado para sacrificarse por un bien mayor si fuera necesario mientras eso detenga a los invasores que se han apropiado de la tierra de su pueblo."
      }
    },
    "team": {
      "title": "Equipo",
      "denis": {
        "rol": "Producer",
        "overview": "Being the Producer of this amazing project has been one of the most interesting experiences of my academic career. Having to organize and assign tasks according to each person’s abilities, plus having to constantly keep in touch with the leads to know exactly what’s going on at all times, has made me improve my organization skills and hoe I manage my time. On the other hand, I have enjoyed having to contact external members for the team to fulfill tasks that were out of our capacities. Taking the responsibility of having to convince those people that the project is worth working on and setting up multiple face-to-face meetings to keep track of their advances.",
        "contributions": {
          "1": {
            "title": "Agile Methodology",
            "text": "After considering various options I found Agile to be the best fitting methodology to face this project. With that decision made I, with the help of the other leads, had to create all the scrum teams for each sprint, with each having a list of tasks they had to complete before the set deadline.<br /><br />On top of that, I conducted sprint retrospectives after every deadline to see how we could improve our performance and communication, mostly between departments. The way these retrospectives were organized was different on every delivery so they wouldn’t get repetitive.",
            "media": [
                "../people/Denis/standup.jpg",
                "../people/Denis/scrum_teams.PNG",
                "../people/Denis/hacknplan.png",
                "../people/Denis/ideaboardz.PNG",
                "../people/Denis/motivacion.PNG",
                "../people/Denis/organigrama.PNG"
            ]
          },
          "2": {
            "title": "HacknPlan",
            "text": "In order to keep track of everyone’s work we used the online tool ‘HacknPlan’, which let us create tasks, assign them to people, log times, change their states, and even move them to the backlog. This turned out to be very useful as everyone could see what tasks were being worked on and which weren’t, so less communication problems would arise.",
            "media": [
              "../people/Denis/tasks.PNG",
              "../people/Denis/individualtask.PNG",
              "../people/Denis/backlog.PNG"
            ]
          },
          "3": {
            "title": "Voice Acting",
            "text": "With the intent to improve the game’s quality and having the help of Ismael Tejada, we organized an online casting for voice the characters of the game. Over 50 people registered, but we only had 5 characters to impersonate, so we decided to double this number by voicing the game both in english and spanish.<br /><br />Once we finished the interviews and decided who was going to perform the different characters in the different languages we organized recording sessions in our university’s recording room. These lasted for 2 weeks and were very enriching, as we learned a lot about the voice acting world.",
            "media": [
              "../people/Denis/casting.PNG",
              "../people/Denis/grabaciones.jpeg",
              "../people/Denis/audacity.png"
            ]
          },
          "4": {
            "title": "Webpage and Music",
            "text": "The other two aspects were we had little to no experience were the webpage design and the music composition.<br /><br />To solve these problems I contacted two external people, one to design our webpage, and the other to produce the main menu’s song. It was a challenge keeping up in contact constantly with them as the project already took a lot of time from me on its own, but it ended up paying off considering the results."
          }
        }
      },
      "alejandro": {
        "rol": "Lead Programmer",
        "overview": "As lead Programmer my main job has consisted in supervising, distributing and assigning each task to the most qualified person to do the best job possible, ensuring that the naming conventions were met, and that everything could be executed in a functional way according to the guidelines of the Design department and the work done by the Art department without compromising the integrity of the code work. Working with our own engine to make our game has been a real challenge that we have faced the whole department as a solid and effective team to be able to move forward the work in the face of all adversity while maintaining a clean and understandable code structure. I am very happy with the work done by my team, we have done things we thought impossible and I am proud of the development we have done at all levels.",
        "contributions": {
          "1": {
            "title": "Physics Engine",
            "text": "My main contribution has consisted in the implementation of the physics engine, which is in charge of managing all the physical objects in the world by triggering OnCollision and OnCollisionEnter events, with physical properties such as the gravity, the mass, the friction, the restitution, the linear and angular damping etc. It also contains a system of constraints on freeze position and rotation, and P2P, and an IgnoreCollision system. Finally it has a Collision Type system in which the developer can choose the figure that best suits the model in which he can choose between a collision type Box, Sphere, Capsule, Cylinder, Cone, Plane and Mesh and modify its size, radius and height. All editable from the RigidBody component.",
            "media": [
                "../people/Alejandro/shapes.png",
                "../people/Alejandro/rigid_body.png",
                "../people/Alejandro/rigid_body_2.png"
            ]
          },
          "2": {
            "title": "Trigger Event",
            "text": "The physics engine includes the OnTrigger, OnTriggerEnter, and OnTriggerExit events. The use of these events has been exploited throughout the game. Thanks to the triggers it has been possible to manage all events and some mechanics that happen during the game like the dialog system, hiding in bushes, activating checkpoints etc."
          },
          "3": {
            "title": "Tags and Layers",
            "text": "The tags and layers system has allowed to determine the type of the objects to condition and mask the events. Some tags and layers are included by default but the developer can add as many as needed.",
            "media": [
                "../people/Alejandro/layers.png",
                "../people/Alejandro/tags_edit.png"
            ]
          },
          "4": {
            "title": "Perception System",
            "text": "The core of the artificial intelligence of the enemies is the Perception System that provides the enemies with a field of vision to detect the players. This system consists of a cone in which the developer can determine the radius, the angle, the amount of raycast it launches, the tag of the object to be detected, whether it should rotate and how many degrees or be static. The main particularity of the cones is that it is a mesh built in real time according to the amount of rays launched that collide with the environment to occlude the spaces in which the player should not be captured and thus improve the visual feedback. You can also choose the framerate at which they are updated to improve game performance, one for when they are inside the camera frustum and another for when they are occluded.",
            "media": ["../people/Alejandro/perception_system.png"]
          },
          "5": {
            "title": "User Data Collection",
            "text": "A file was created to record all the user's data while playing during PlayTesting sessions, such as the game round, the level they are in, the total number of deaths, the game time, the player they were using when they lost and the position of the player where they had died. All this to help level design to identify action bubbles that failed and should be redesigned for difficulty.",
            "media": ["../people/Alejandro/user_data_collection.png"]
          },
          "6": {
            "title": "Pop Up",
            "text": "The tags and layers system has allowed to determine the type of the objects to condition and mask the events. Some tags and layers are included by default but the developer can add as many as needed.",
            "media": [
                "../people/Alejandro/WorldToScreen.png",
                "../people/Alejandro/explosion.png",
                "../people/Alejandro/knife_paul.png",
                "../people/Alejandro/trap_stilgar.png"
            ]
          }
        }
      },
      "ismael": {
        "rol": "Lead designer",
        "overview": "From minute zero, I have felt fortunate to have the opportunity to lead a magnificent and very capable design team. In this project I have developed as a Designer and as a person, since organizing the whole team to make a design on a genre that we did not know much about, has been a challenge to face and I can be proud of the teamwork. I have learned to work side by side with my colleagues and to use all the feedback in a constructive way. My main task in this project has been to know the capabilities of each person in order to assign the most appropriate tasks and to get the maximum potential out of each part. I have also focused on monitoring the development of all design tasks and overseeing the cohesion of the project, providing assistance to different departments when necessary.",
        "contributions": {
          "1": {
            "title": "Team management",
            "text": "My main task as Lead Designer has been to focus on the management of the department generating different teams within the agile Scrum methodology, evaluating the different capabilities of each member. Within this contribution I have helped the different teams in the development of their different tasks, from level design, character and enemy design, narrative, UX experience to production tasks. "
          },
          "2": {
            "title": "Narrative",
            "text": "Together with Enric Morales and Marc Ruiz, I have been in charge of supervising the script and planning the narrative pacing of the game throughout the experience we offer to the player, so that there is coherence between the narrative and the level design."
          },
          "3": {
            "title": "Castings and Dubbing",
            "text": "In collaboration with Denis Deconinck, I opened a casting of voice actors to work with us to give life to the characters we have created in our project.I am personally proud of the results obtained in the castings, seeing that people specialized in different sectors of the world of dubbing and cinema have joined our cast of voice actors, managing to add to our project professionals who have participated in major studios such as Disney, Pixar and Marvel Studios, in important roles such as America Chavez in 'Doctor Strange in the multiverse of madness' or Raya in 'Raya and the last dragon.'"
          },
          "4": {
            "title": "Level Design",
            "text": "Regarding level design I have created several concepts of different iterations of level 2, corrections in level 1 and made a supervision of all of them to ensure consistency and coherence between them. I have designed the narrative pacing of all levels to facilitate the insertion of dialogue events.",
            "media": [
                "../people/Ismael/concept_level.png",
                "../people/Ismael/map.jpg",
                "../people/Ismael/IMG_0023.jpg"
            ]
          },
          "5": {
            "title": "UX & UI Design",
            "text": "Together with Albert Pou and Pau Motta I have designed and developed part of the UI implemented in the project and made different iterations that, together with the code department, has been implemented and supervised in its different phases of development."
          },
          "6": {
            "title": "Feedback",
            "text": "Together with several members of the design team and code lead Alejandro Moreno I have supervised and helped to create several visual and sound feedback systems to help the player accordingly to the actions that happen in our game. Feedback systems such as dynamic sound area indicators, indicators for throwing objects in the skills section and managed the cognitive load of these.",
            "media": ["../people/Ismael/move.gif"]
          },
          "7": {
            "title": "Production Tasks",
            "text": "I have provided support in the different production tasks that required support, such as the search for new assets for the project, as the musical composer, conducting interviews in castings, documentation management, layout and assembly of organizational charts in the pipeline of the project."
          },
          "8": {
            "title": "Playtesting",
            "text": "During several playtesting sessions, both behind closed doors with my colleagues and in front of the public, I have learned to collect and examine the feedback provided to us about our project in order to correct and polish different aspects of it and to acquire the ability to redirect the guidelines of the department and make the team's work more flexible."
          },
          "9": {
            "title": "Artistic Support ",
            "text": "I have provided artistic support by designing and developing 3D modeling for character abilities, such as Paul Atreides' eagle and throwing knife. For the initial documentation of the GDD draft, I was in charge of the visual design, generating templates both for this doc and for the documentation of the presentations for the stand-Ups.",
            "media": [
                "../people/Ismael/ab1.jpg",
                "../people/Ismael/ab2.jpg",
                "../people/Ismael/ab3.jpg",
                "../people/Ismael/gdd1.jpg",
                "../people/Ismael/gdd2.jpg"
            ]
          }
        }
      },
      "carles": {
        "rol": "Lead Artist",
        "overview": "Hello there, welcome to my page! I am Carles, the Lead Artist for TDM.The main objective of my work during this project has been to organize and oversee the work of my department and to assign the right task to the right person. In addition to that, my job was also to lend a hand to whoever needed aid so that we could push through crunches with a good resultThe organization of the team has been a real challenge during the development of the game, as communication had to be constant and clear, but we have managed to overcome the difficulties we were presented with and delivered as needed. I’m especially proud of the evolution my team has made over these few months.",
        "contributions": {
          "1": {
            "title": "Concept Art",
            "text": "During the first stages of the development, I worked in tandem with the Design Department to create concept art and moodboards of the levels so that we had a visual representation of the ideas they were contemplating.",
            "media": [
                "../people/Carles/concept_art_1.jpg",
                "../people/Carles/concept_art_2.png"
            ]
          },
          "2": {
            "title": "Audio Design",
            "text": "Working together with the Design Department, we created an Audio Design Document that I followed to obtain a first iteration of the VFXs and placeholders for the music of the game, so that we could have an ambience set. To do so, I used rFXGen for UI purposes and modified audios from soundsnap with Audacity to fit our needs.",
            "media": [
              "../people/Carles/audio_design_1.png",
              "../people/Carles/audio_design_2.png"
            ]
          },
          "3": {
            "title": "Documentation and Workflow",
            "text": "As I’ve mentioned before, I was part of the creation of the Audio Design Document, but I also created other types of documentation so that our team would work smoothly. The most significant ones would be: a document for naming conventions, organizational documents to distribute tasks for each sprint and being part of the animations list document. In addition to the creation of these documents, I was in charge of organizing the files in our shared folder, to make the Art delivery and to make sure that the pipeline was followed correctly."
          },
          "4": {
            "title": "HUD and Logo",
            "text": "To help with the UI, I got the sketches of the ability Icons, put them into Adobe Illustrator and gave them a bit of an overhaul so that they would look more polished and minimalistic. Also, I did several iterations of the Logo of the game and ended up with the one shown below, which mixes the Atreides’ House symbol and the Fremen’s crysknife.",
            "media": [
                "../people/Carles/hud_and_logo_1.png",
                "../people/Carles/hud_and_logo_2.png"
            ]
          },
          "5": {
            "title": "Ability Models",
            "text": "Using Maya I created the models for Stilgar’s Sword and his Stunner gun following the material of the movies.",
            "media": [
                "../people/Carles/abilities_1.gif",
                "../people/Carles/abilities_2.gif"
            ]
          }
        }
      },
      "arnaub": {
        "rol": "Programmer",
        "overview": "As a member of the code team, my role in this project has been to help to develop the game and improve its engine. I've been able to work in many different fields during the development of our game. I've also been in charge of some Scrums, being their Scrum Master, mostly in the late part of the development of the game, leading my teams to the best result possible. It has been an experience with ups and downs, like a rollercoaster, but we have reached the end with a satisfactory result, and I am personally very proud to have shared it with my teammates.",
        "contributions": {
          "1": {
            "title": "Scripting System",
            "text": "In order to be able to develop the game inside our engine, it was necessary to implement a script system in C#, just like in Unity. To do this, I implemented the Mono Project library.<br /><br />Among the features of this scripting system are:<br /><ul><li>- Hot Reload, using MSBuild.exe and .NET Framework.</li><li>- In-engine script creation.</li><li>- Add Script Component to GameObject</li><li>- In-engine public variables and GameObject Drag and Drop.</li></ul>",
            "media": ["../people/ArnauBonada/scripting.gif"]
          },
          "2": {
            "title": "Spritesheet Particle System",
            "text": "When the Particle System was implemented, we also wanted to add a Unity-like Particle System using Spritesheets, which generates an animation of the particles using a single texture with all the necessary frames.",
            "media": ["../people/ArnauBonada/particle.gif"]
          },
          "3": {
            "title": "VFX",
            "text": "I also contributed to the creation of vfx, mainly particles for some skills: Knife, Hunter Seeker and Eagle.",
            "media": [
                "../people/ArnauBonada/ab1.gif",
                "../people/ArnauBonada/ab2.gif"
            ]
          },
          "4": {
            "title": "Win and Lose Scenes",
            "text": "During the development of the game, from the design team came the idea of creating scenes for the Main, Win and Lose menus. These scenes have the three main characters in a game scenario, and each character would have a different animation depending on the scene they are in. My role here was to implement the Win and Lose scenes, and I also helped in the main menu scene",
            "media": [
                "../people/ArnauBonada/win.gif",
                "../people/ArnauBonada/loose.gif"
            ]
          },
          "5": {
            "title": "Cinematics",
            "text": "In the last days of the game development, it was considered the option of implementing some cinematics, to show the dialogues of the characters as a video in-game. My role here was to do the Cinematic 3, but due to time and coordination issues, it could not be implemented in the Gold version.",
            "media": ["../people/Carles/cinematic.gif"]
          }
        }
      },
      "carlos": {
        "rol": "Programmer",
        "overview": "My objective in this project was to improve my programming skills and learn to work with other teammates, including coders, designers and artists. I think I have accomplished them. Speaking about the project, it was tough. I learned the problems of working with lots of people and bad programming, but also I acquired the aptitudes to solve them. I am proud of the work I have done, and proud of the game we have done.",
        "contributions": {
          "1": {
            "title": "Prefabs",
            "text": "During the first vertical slice I was in charge of the implementation of the prefab system for our engine. <br />I tried to do it the easiest way possible for everyone. I could finish it on time and without major problems.",
            "media": ["../people/Carlos/prefabs.gif"]
          },
          "2": {
            "title": "Particles",
            "text": "For vertical slice 2 I was charged to upgrade, optimize and fix the particle system that was having problems. Since then, I worked on everything that needed the particle system. I worked on fixing all the problems that appeared during the development, and I was responsible for implementation of the VFX that included particles on the game.",
            "media": [
              "../people/Carlos/particles_system.gif",
              "../people/Carlos/particles_vfx_1.gif",
              "../people/Carlos/particles_vfx_2.gif"
            ]
          },
          "3": {
            "title": "Players, abilities and Enemies",
            "text": "From the alpha 2 I was charged with the task of preparing, fixing and completing the models, textures and animations of the characters controlled by the player, their abilities and all the enemies.<br />During this I had to create or fix behaviors of the enemies, for example: stunned or distracted. Also I had to implement or fix some of the behaviors regarding animations and abilities in the C# script.",
            "media": [
              "../people/Carlos/characters.gif",
              "../people/Carlos/abilities.png",
              "../people/Carlos/enemies.png"
            ]
          },
          "4": {
            "title": "Levels",
            "text": "Finally in beta, I was in charge of the complete implementation of models, textures and enemies positions of levels 2 and 3 that were not done until now. It was tough because the engine could not support ngons, large meshes or meshes with lots of polys, so me and the artists had a difficult time trying not to crash the engine. Also there are a lot of elements (basically on level 2) and I had to put every texture one by one.",
            "media": [
              "../people/Carlos/level2.png",
              "../people/Carlos/level3.png"
            ]
          }
        }
      },
      "davidg": {
        "rol": "Programmer",
        "overview": "With this project I have been able to boost my overall programming skills alongside a good engine code structure to make it sustainable for the long term. I also learnt a lot about graphics programming and how to set a scripting system. Furthermore, I also learnt how to work with a mid-sized team, efficient communication and give and receive feedback. This project has helped me to finally decide that I want to dedicate myself to graphics programming and rendering or game engine programming.",
        "contributions": {
          "1": {
            "title": "Cel Shading and Outline post processing",
            "text": "Developed the cartoonish visual style by implementing Cel Shading in the shader lightning calculations and also a post processing edge detector done with the color, depth and normals textures of the scene. The threshold value can be edited for each object so it has more outline or less.",
            "media": ["../people/DavidGonzalez/CelShading_and_outline.png"]
          },
          "2": {
            "title": "Real time lightning and shadow mapping",
            "text": "Implemented a real time lightning system with directional lights, point lights and spot lights. They all have ambient, diffuse and specular colors. Additionally, real time shadow mapping has been implemented to give more realism to the environment.",
            "media": [
              "../people/DavidGonzalez/Lights1.gif",
              "../people/DavidGonzalez/Lights2.gif",
              "../people/DavidGonzalez/Shadows.gif"
            ]
          },
          "3": {
            "title": "C# Bindings",
            "text": "I helped setting the C# scripting system up and reworked the way components were created. Besides that, I also implemented the core bindings alongside the components migration in order to fulfill an easy scripting API.",
            "media": [
              "../people/DavidGonzalez/Csharp.png",
              "../people/DavidGonzalez/CsharpMigratedComps.png"
            ]
          },
          "4": {
            "title": "Stencil, normals and emissive",
            "text": "Built a system where the objects that are occluded can be seen through, with a chosen color from scripting, using the stencil buffer. I also implemented normal mapping in order to give roughness sensation and emissive colors to highlight the objects.",
            "media": [
              "../people/DavidGonzalez/Stencil.gif",
              "../people/DavidGonzalez/NormalMap.png"
            ]
          },
          "5": {
            "title": "Particles’ batch renderer",
            "text": "This allowed to improve the engine’s performance by just accumulating quads and flushing them onto one draw call instead of doing one draw call per quad, which would have been extremely inefficient.",
            "media": ["../people/DavidGonzalez/BatchRenderer.gif"]
          },
          "6": {
            "title": "Cinematics 2 and 7",
            "text": "In order to power the players’ feeling, we created some cinematics, of which I did the number 2 and 7.",
            "media": ["../logo.png", "https://picsum.photos/1600/900"]
          }
        }
      },
      "himar": {
        "rol": "Programmer",
        "overview": "My contribution to this project has been more focused on system programming than gameplay. The input system took up all my time in the first installments, and when I finished I started with the post-production and implementation of all the game's audio. For the last installments I have focused on improving the visual feedback of the game.",
        "contributions": {
          "1": {
            "title": "Input System",
            "text": "My main contribution to the project has been the development of an input system that largely automates the implementation of skills and actions in the game.<br />The system is based on the new input system Unity released a year ago. Its operation is simple:<br />We save action maps (nodes) in an XML file, which contain different actions. Each action is assigned a series of inputs or keys and, finally, through a component assigned to a game object, we assign the function that will be called when the input of each action is pressed.<br />This system can help to develop the following:<ul><li>- Different skills for each character</li><li>- Interchangeable controls in the options</li><li>- Code optimization</li></ul>",
            "media": ["../people/Himar/ezgif-2-b031797f56.gif"]
          },
          "2": {
            "title": "Audio implementation",
            "text": "I have also been in charge of the implementation of music and sound effects in the game.<br /><br />FI did the post-production of the audio clips using Wwise, an audio software focused on video games. As an addition, I was in charge of editing and recording the sound of the voices in the game.<br />F<br />Finally, I implemented this sound in code and adapted the engine on certain occasions for the proper functioning of said audio.",
            "media": ["../people/Himar/wwise_logo.png"]
          },
          "3": {
            "title": "Cursor feedback",
            "text": "Finally, I have contributed to the implementation of visual feedback to the game, adding a small system of cursors and designing these cursors myself.<br />F<br />FFor the system I have used the functions that SDL offers when creating and adding cursors, and for the design I have used a program called icoFx, specifically for the design of icons and cursors.",
            "media": [
                "../people/Himar/chani_hunter_seeker.png",
                "../people/Himar/chani_spice_grenade.png"
            ]
          }
        }
      },
      "ignasi": {
        "rol": "Gameplay/Systems Programmer",
        "overview": "I certainly believe that what we have achieved with this project is something to be taken into account by all the people who may come to value us at some point in our lives. Thanks to the efforts of everyone involved, we have managed to make a contribution to the industry that really feels like our own. And the feeling of having achieved it is something I thought I would never feel. Thanks to this project I have been able to see where I want to direct my career as a programmer, since I have dedicated myself in large part to the creation of the logic of the information management systems of the players and the enemies, and also, it has helped me to know the experience of working in a team as if it were a company; but most importantly, and what I will always take with me, is that this project has taught me to fail, accept criticism, mend my mistakes and obtain results even greater than the previous ones.",
        "contributions": {
          "1": {
            "title": "Player Management",
            "text": "In the first instance I was in charge of creating the logic and laying the foundations of the Player Manager, that is, the logic behind the control of all the playable characters, from movement to skill casting. I generated a base file with the ability to store as many players as you want, have up to 4 skills (with their respective casts or cancellations), a system to correctly keep the cooldowns of each character, etc.",
            "media": [
              "../people/Ignasi/PlayerManagerPicture1.png",
              "../people/Ignasi/PlayerManagerPicture2.png"
            ]
          },
          "2": {
            "title": "Enemy Management",
            "text": "After the Player Manager, I was given a similar task, and that was, again, to create the logic and foundations for the Enemy Manager. Today the file is completely different from what I originally conceived, but the basic functionalities I thought of and programmed are still there. <br />Basically, the creation of the enemies is done through the information it receives through the Level Managers (position and type of enemy, as well as whether it patrols or not). With this, through a loop and several algorithms that are nowadays quite optimized, it was possible to create a quite acceptable behavior that is controlled from the same space. ",
            "media": [
              "../people/Ignasi/EnemyManagerPicture1.png",
              "../people/Ignasi/EnemyManagerPicture2.png"
            ]
          },
          "3": {
            "title": "Level Management",
            "text": "Finally, since I had already taken care of the Managers of two really important parts of the code, I was given the third and last major management task thanks to the experience I had gained during the creation of the two previous scripts. <br />For the Level Manager, I evaluated the shortcomings of our engine, and tried to create scripts that behaved like big batteries of information for each level, so that the logic and algorithms (Player and Enemy Manager) would be separated from all the raw information weight. With this I managed to create a triangular communication vehicle with which we optimised the handling of all the information, objects, and functions that were used or found in each level.",
            "media": [
              "../people/Ignasi/LevelManagerPicture1.png",
              "../people/Ignasi/LevelManagerPicture2.png"
            ]
          },
          "4": {
            "title": "Ability Programming",
            "text": "Together with Oriol Valverde and Isaac Digón we were in charge of programming all the logic behind the 12 skills that exist in the game. Personally I was in charge of all Stilgar's abilities, i.e. the sword, the stunner, the trap and the whistle; and talking about Chani's abilities, I programmed the spice grenade.<br />It was a simple job at the beginning, but it became more complicated as the game progressed in all aspects. During each release we had to fix or add new things, but I think the end result of the skills is really interesting and cool. ",
            "media": [
              "../people/Ignasi/ab1.png",
              "../people/Ignasi/ab2.png",
              "../people/Ignasi/ab3.png",
              "../people/Ignasi/ab4.png"
            ]
          },
          "5": {
            "title": "Quality Assurance",
            "text": "After all the previous work, I was busy fixing all the skill-related bugs that came in from the Playtesting sessions. I personally took care of several bugs related to the skills that generate noise areas, as well as small hotfixes to make everything work properly.<br />On the other hand, and until the end of the project, together with my colleagues we have been working on making the game look as nice and finished as possible, having as a personal task that the skills were launched according to the animations that we received from art."
          }
        }
      },
      "isaacd": {
        "rol": "Programmer",
        "overview": "AThis project has been truly an ambitious enterprise, and the burden of going from scratch to a complete game has posed both an appealing goal yet a crunching madtime. Getting to know my colleagues better has proven to be very comforting, and despite all the fun times, I still got somewhat unmotivated early on. However, regarding back all the effort condensed into this final result I feel proud of the team as a whole. Staying in the programming department, in which we really lacked some personal back then, I developed a few features to be taken as first approaches, always focusing on functionality.",
        "contributions": {
          "1": {
            "title": "Animations Core",
            "text": "Along with Ignasi Pardo, we were assigned this task at the very beginning of the engine development. One such capability as animations were crucial for a fine result, and so we had to develop our own animation importer, loader from custom file format and modules for playing them. Although the blending of keyframes got finished by other team members, we managed to emplace the Assimp library into our “fully fledged” engine.",
            "media": ["../people/IsaacDigon/Animation.gif"]
          },
          "2": {
            "title": "Camera Component",
            "text": "Once the base engine was somewhat finished and it was due time to begin with the gameplay core functionality, Denis and I built the first approach to a camera component. This was to be used in game and be the main input point for the player. After some matrix transformations, a simple version was done, yet we later had to iterate the movement constraints many times, correct the image frame buffer process and enhance the overall experience. We even added a shake functionality.",
            "media": ["../people/IsaacDigon/Camera.gif"]
          },
          "3": {
            "title": "Ability - Hunter Seeker",
            "text": "Later in the development, already having started programming gameplay itself, I formed part of the abilities team. We were to find feasible solutions for the list of abilities the design department had evaluated final. I personally built the first approach to this ability, which at the time was to resemble a flying drone that killed on explosion. The thing is controlled by the player whilst disabling character movement so it can command the insect at ease. After some iterations, the movement details got adjusted, and the detonation was replaced with a collision trigger.",
            "media": ["../people/IsaacDigon/Ability.gif"]
          },
          "4": {
            "title": "Memory Leaks",
            "text": "By making as good use as I could of the mmgr library another team member had implemented into the engine, I pushed away the major memory leaks up until the later release of the game. Many of them were due to improper cleaning, a very reasonable cause given the amount of people working on the same code and the various modules each member ended up taking part in. Still a few minor leaks got through and could not be resolved due to their spread among many items in the hierarchy (in a way that made them untrackable).",
            "media": ["../people/IsaacDigon/Memleak.gif"]
          },
          "5": {
            "title": "Note",
            "text": "Taking part in such a large team, given our experience back then, I have realized how much work there is always to do, so I sincerely thank everyone, specially the code department, for such fine organization and effort to get through this humble project in the most professional of ways it could."
          }
        }
      },
      "lucas": {
        "rol": "Programmer",
        "overview": "This project has allowed me to learn many things, to improve my programming skills and to structure my code correctly. First of all, I have learned to work with a medium sized team, communicating with the other departments and giving and receiving feedback. I also learned how to implement things I had never done before like the animation system and the Scene Manager. These were quite a challenge for me, as they were really difficult to implement, and there wasn't much time. Overall, I think I did a great job during the whole project and I am very happy with the outcome of the project.",
        "contributions": {
          "1": {
            "title": "Ragnar Engine",
            "text": "The engine base was developed a couple of months before we started the Dune project. The selection of the engine was made by the whole class.<br />The engine base was solid, had no memory leaks and also had an audio system implemented with Wwise.",
            "media": ["../people/Lucas/RagnarEngine.gif"]
          },
          "2": {
            "title": "Animation System",
            "text": "The animation system was difficult to implement as it was done from scratch in one week. Later, improvements were made to the animation system that drastically reduced the time it took to calculate.",
            "media": ["../people/Lucas/AnimationSystem.gif"]
          },
          "3": {
            "title": "Boss",
            "text": "Implementing the boss was both an interesting and difficult challenge. The boss has 4 phases, with different behaviours in each one. It was difficult to make the boss challenging for the player, but also clear and easy to understand.",
            "media": ["../people/Lucas/Boss.png"]
          },
          "4": {
            "title": "Scene Manager",
            "text": "I was in charge of helping to create the Scene Manager. The Scene Manager of Unity was used as a reference for this. The Scene Manager allows you to manage different scenes, and to switch between scenes from scripting.",
            "media": ["../people/Lucas/SceneManager.png"]
          },
          "5": {
            "title": "Save System",
            "text": "I have helped to create a save and load system for the game, taking advantage of some of C#'s own files.",
            "media": ["../people/Lucas/SaveSystem.png"]
          },
          "6": {
            "title": "Optimizations",
            "text": "In the last deliveries I was in charge of supervising certain parts of the code, using a profiler to observe where code optimisation was needed, especially to catch the components of the objects and in the animations, which were greatly reduced in processing time. Even so, during the whole project I was very careful to make sure that my code was efficient and clean.",
            "media": ["../people/Lucas/Optimizacion.png"]
          }
        }
      },
      "magdalena": {
        "rol": "Programmer",
        "overview": "From the very beginning my main goal was to improve and develop my skills and I am very happy that I had an opportunity to take part in the creation of this game. I feel I have learned a lot about developing a big project as a part of a team. On a day-to-day basis I was working closely with my code department teammates and also with artists and designers and this cooperation made us achieve an impressive final result. Thanks to this project I have leveled up both my programming and communication skills. Now I am better prepared to work on the development of professional projects that require time management, good problem-solving and communication abilities. ",
        "contributions": {
          "1": {
            "title": "Particle System",
            "text": "I have been working in the development of the particle system in the game engine using C++.<br /><br />My contribution included:<ul><li>- Building the base code of the particle system using object pooling for optimization</li><li>- Coding some particle effects such as velocity, acceleration, color, spawn in the spherical, cubicle and conical sphere shape</li><li>- The billboard (particles rotate to always face the camera)</li><li>- Special timer that allows specifying the duration of the particles’ effect</li></ul>",
            "media": [
                "../people/Magda/particle_system.gif",
                "../people/Magda/billboard.gif"
            ]
          },
          "2": {
            "title": "Particle Effects",
            "text": "The particle system has been used in our game many times to build different effects. I created the following ones: character’s shield, fire, sand wind, destroyed drone’s explosion and sand spatter after the fall of an object.",
            "media": [
              "../people/Magda/Shield.gif",
              "../people/Magda/sand_wind.gif",
              "../people/Magda/dron_destroyed.gif"
            ]
          },
          "3": {
            "title": "Perception cone’s color change",
            "text": "I was responsible for making the perception cones of enemies change their color when the player is detected. The function used for the color switch depends on the time that player spends in the area of vision of the enemy.",
            "media": ["../people/Magda/perception_cone.gif"]
          }
        }
      },
      "mario": {
        "rol": "Programmer",
        "overview": "The creation of this project is an achievement of which both I and my colleagues should be proud. More than the end result, what I take away from it is the effort and the way I have approached this challenge. Although I have not been able to participate as a gameplay programmer, which is what I hope to become, I have had the opportunity to work in certain branches of development that also motivated me as a tool Programmer.",
        "contributions": {
          "1": {
            "title": "Nav Mesh",
            "text": "The movement of our game focuses on the pathfinding system. We used Recast, an open source library to create navmesh in the scene models.<br />Along with this library we used Detour, a set of pathfinding tools that allowed us to make the movement of all the entities on the stage. These 2 tools have allowed us to create a NavMesh on the objects of our choice and draw a path to make the entities follow it.",
            "media": ["../people/Mario/NavMesh.gif"]
          },
          "2": {
            "title": "Player Manager",
            "text": "In our game you can control more than one character. I worked on the first iteration of the Player Manager that allowed us to control 1 to 4 characters in the scene by switching between them with an assigned button.",
            "media": ["../people/Mario/PlayerManager.gif"]
          },
          "3": {
            "title": "Dialogue System",
            "text": "Continuing with the work of a colleague, I implemented a new dialogue system that allowed to read the texts from an external document and associate each speaker with its line of dialogue, separating the conversations by ID to improve their organization and make them easier to edit for the dialogue team, which would be in charge of modifying them.<br />Dialogues are activated by triggers that stop character movement and activate the dialogue system during gameplay.A language switch was also implemented, to choose from Spanish to English. It can also be changed during the dialogues.<br />Along with the above work, related UI bugs were also fixed.",
            "media": ["../people/Mario/DialogueSystem.gif"]
          },
          "4": {
            "title": "Cinematics",
            "text": "I created a generic manager for all the cinematics with an individual state machine for each scene that allowed us to control the events that happened in each line of dialogue such as: character animations, sound effects, character movements. In addition, I made some of these cinematics.",
            "media": ["../people/Mario/Cinematic.png"]
          }
        }
      },
      "oriolb": {
        "rol": "Programmer",
        "overview": "This project improved my teamwork skills, I also learned how to work under pressure and with different departments. Also, I had the pleasure to work with new code teammates that gave me different perspectives on how they work or code. As a member of the code team, I implemented different systems like the animation system, or tools like the save system, as well as developed some core mechanics like the boss. Although I have helped in mechanics, my goal was to give the team different utilities that made the coding and implementations easier.",
        "contributions": {
          "1": {
            "title": "Base engine “Ragnar Engine”",
            "text": "The base of the engine was developed for ~3-4 months before starting the project itself. The engine was selected by the class.<br />The base of the engine had no memory leaks, and had the audio system implemented in it with Wwise. The system itself was later on improved a little bit for the project.",
            "media": ["../people/OriolBernal/Ragnar.gif"]
          },
          "2": {
            "title": "Animation system ",
            "text": "This system was very hard to implement and followed me for the rest of the project. It was implemented in one week from scratch via shaders, but later on received different upgrades that helped to reduce the time it took to calculate all the bone animations. I was also given the task to give the animations the ability to interpolate between them, making the animations smoother.",
            "media": ["../people/OriolBernal/Animations.gif"]
          },
          "3": {
            "title": "Boss",
            "text": "I implemented the different phases of the boss. The phases included: Patrolling, calling more guards, hitting the ground, throwing rocks, and more.<br />The design team wrote a document with all the mechanics that the boss needed and I had to implement all of them. The boss had some redesigns that needed to be implemented after the playtesting phase.",
            "media": ["../people/OriolBernal/boss.gif"]
          },
          "4": {
            "title": "Scene Manager",
            "text": "I implemented the scene manager that was needed to swap between scenes to have better control of the multiple scenes we have in the game. <br />It helped a lot for other systems like the save system, or the game loop.",
            "media": ["../people/OriolBernal/sceneManager.gif"]
          },
          "5": {
            "title": "Save System",
            "text": "I was given the task to implement a save system for the game. Instead of using the engine itself, I thought it would be better to save the game from the scripting part. So all the save system was made in C# and was made so that anyone could save with a little bit of knowledge of how the system works.",
            "media": ["../people/OriolBernal/saveSystem.gif"]
          },
          "6": {
            "title": "Optimization",
            "text": "I helped with the optimization of the engine from the beginning, but with more emphasis on the last delivery. The part I optimized the most was the animation system, which followed us until the end. The time it took to calculate animations got reduced considerably.",
            "media": ["../people/OriolBernal/Optimization.png"]
          },
          "7": {
            "title": "Audio",
            "text": "At the beginning one of the tasks I had was also to put audios with Wwise for the engine. When doing this, I noticed that the audio system could be improved, so I decided to improve the functionality of it by allowing more clips and the possibility to stop single audio clips at any moment.",
            "media": ["../people/OriolBernal/Wwise.png"]
          }
        }
      },
      "oriolv": {
        "rol": "Programmer",
        "overview": "At first I thought it would be like the vast majority of other projects I've been doing, with a small group of people. This project has made me see that an already quite large group of people is very different from anything I've ever done. It is much more difficult to organize and if someone does not get the job done on time, someone else will be delayed as a result. Apart from this, this experience has made me a better programmer in relation to frontend developer with C# because of its similarity with the engine used in a wide market called Unity. I am very proud of the final result despite some comments denying it and I think it has been a necessary subject in the development of a game developer. Much of my contribution to this project has basically been C# programming in the engine to make the game functional. Although at the beginning before it was implemented, I was dedicated to helping several groups in engine code and small tasks that the lead was giving me.",
        "contributions": {
          "1": {
            "title": "Player abilities",
            "text": "Much of my work on this project has been creating most of the abilities for both Paul and Chani. Thanks to the logic of the player manager, the skills work by generating an empty gameObject where in the Start what is necessary is calculated before being able to do it, such as if you have selected an enemy or if you have to change something internal to the prefab."
          },
          "2": {
            "title": "Paul",
            "text": "",
            "media": [
              "../people/OriolValverde/Paul1.gif",
              "../people/OriolValverde/Paul2.gif",
              "../people/OriolValverde/Paul3.gif",
              "../people/OriolValverde/Paul4.gif"
            ]
          },
          "3": {
            "title": "Chani",
            "text": "",
            "media": [
              "../people/OriolValverde/Chani1.gif",
              "../people/OriolValverde/Chani2.gif"
            ]
          },
          "4": {
            "title": "God Mode",
            "text": "For a while, if we wanted to debug something that was not at the beginning of the game, we had to play to the location we wanted to test. This was very time consuming. That's why I decided to make the God Mode system to be able to teleport to other areas or so that enemies couldn't attack you.",
            "media": [
              "../people/OriolValverde/God.gif",
              "../people/OriolValverde/God2.gif"
            ]
          },
          "5": {
            "title": "BugFixing",
            "text": "At the end of the process I dedicated myself to solving the bugs that were related to Paul and Chani's skills. For example, when throwing the knife, the enemies would die if they stepped on it or Chani's backstab when killing a specific enemy would blow up the game."
          }
        }
      },
      "oscarc": {
        "rol": "UI Programmer",
        "overview": "The development of this game has shown me what I am capable of. Making a game in 16 weeks has been an incredible experience, creating a game that we can be proud of among so many people is an achievement, but overcoming all the challenges and obstacles that we have encountered along the way, that is what I really value. It's the most realistic approach I've ever had to a working environment in this industry, and I appreciate having been part of it. In the code team, we have improved the great engine, Ragnar Engine, implementing several systems to be able to develop the game comfortably. I have been working on the UI system and the feedback of it.",
        "contributions": {
          "1": {
            "title": "UI System",
            "text": "The implementation of the UI system was my main task at the beginning of the project, we had to adapt it since we had originally developed it for a different engine. We created several UI elements such as buttons or sliders, but as development progressed we implemented new ones as we needed them.",
            "media": ["../people/OscarCanales/UISystem2.gif"]
          },
          "2": {
            "title": "UI Screens",
            "text": "I worked on the creation of several scenes that were not part of the gameplay, like the Main Menu, Pause, Win and Lose screen. And in updating these scenes as development progressed.",
            "media": [
              "../people/OscarCanales/Screens1.gif",
              "../people/OscarCanales/UiScreen.png"
            ]
          },
          "3": {
            "title": "Feedback",
            "text": "To improve the player experience, we have spent a lot of time and effort in improving all the feedback, so that the player has the most information possible.",
            "media": ["../people/OscarCanales/UIsystem.gif"]
          },
          "4": {
            "title": "Bug Fixing",
            "text": "As always, any code implementation ends up causing bugs everywhere. So another job I've spent part of the project on has been fixing all these bugs."
          },
          "5": {
            "title": "Extras: Dialogue System",
            "text": "Before we had the cinematics, we had a dialogue system to explain the story to the players.Finally, it was removed from the game as the cinematics were already working properly.",
            "media": ["../people/OscarCanales/Dialogue.gif"]
          }
        }
      },
      "raul": {
        "rol": "Programmer",
        "overview": "Even though this project has been way more time consuming than expected, it's been funny. I’m very satisfied with the result of, not only my part of the work, but the whole project.",
        "contributions": {
          "1": {
            "title": "Corpse Carrying",
            "text": "The characters have the ability to carry the dead bodies of the enemies to get them out of sight of other enemies.<br /><br />It uses the same raycast for the movement. If the player clicks B and left button mouse when an enemy is dead, the player will pick that enemy up. Doing it once more the player is able to drop it where they want.",
            "media": ["../people/Raul/CorpseCarry.gif"]
          },
          "2": {
            "title": "Sound Area",
            "text": "The Sound Area is a Prefab with a Circular Trigger. It’s instantiated when something is making noise. When an enemy hears that sound, it will look in that direction. <br /><br />Thanks to its script, depending on the parent, it will disappear in an established time or stay in the game. The size of it can be easily changed with the respective function. Contains an light area as feedback, that increases/decreases at the same speed as the trigger does.",
            "media": [
                "../people/Raul/SoundArea.gif",
                "../people/Raul/SoundAreaEditor.gif"
            ]
          },
          "3": {
            "title": "Navigation",
            "text": "<b>NavAgent</b><br />Agent fully customizable. Initial physical properties are setted according to the <b>NavMesh</b>.<br /><br />Point and Click<br />Uses a raycast to calculate its projection relative to the NavMesh. That point can be used as the destination of the Agent.<br /><br /><b>PathFinding</b><br />Calculates a path to the indicated position. The path is a set of points that the Agent will follow. It gently rotates to look at the point.",
            "media": [
                "../people/Raul/ObstacleNavigator.gif",
                "../people/Raul/MultiHeightNavigator.gif"
            ]
          }
        }
      },
      "unai": {
        "rol": "UI Programmer",
        "overview": "My contribution to this project has been the programming of the UI in general, creating the various menus and submenus, start screen, credits screen, pause screen, options screen, win, lose, etc.. In addition to the assembly itself the programming of the various buttons, sliders, dropdowns, etc., both in its operation and the actions of each of them, has also worked on a system of animations that allows to transmit feedback to the user for the various actions that occur in the game, all this has been programmed with the intention that the loading times are as little as possible to maintain user immersion.",
        "contributions": {
          "1": {
            "title": "Menus and submenus",
            "text": "As you can see different menus have been implemented with different functions and structures, some of these menus contain submenus that allow access to different sections such as options, credits, pause menu, etc..., have been programmed so as to stop as little as possible the immersion of the player avoiding as much as possible long waiting times and always enhancing the feedback to the user.",
            "media": [
              "../people/Unai/optionsControls.png",
              "../people/Unai/credits.png",
              "../people/Unai/game.png"
            ]
          },
          "2": {
            "title": "UI Animations",
            "text": "We have developed a system of animations for the UI, this system is mainly used to transmit different types of feedback to the player, either to indicate that the player has changed player or also to transmit that the player has received a hit, also used in the menus in case of having a focused button, and in the case of the button clicked. The system works on the basis of images that are displayed in an orderly fashion.",
            "media": [
              "../people/Unai/ability-aviable_Trim.gif",
              "../people/Unai/player_die.gif",
              "../people/Unai/botones-menu_Trim.gif",
              "../people/Unai/credits-main-menu_Trim.gif",
              "../people/Unai/missions-animation_Trim.gif",
              "../people/Unai/options-main-menu_Trim.gif",
              "../people/Unai/win-screen_Trim.gif",
              "../people/Unai/lose_Screen.gif"
            ]
          }
        }
      },
      "adrian": {
        "rol": "Designer",
        "overview": "During this project I learned how to design some aspects of a video game from scratch (mostly, enemies and boss design). Moreover, I improved my programming skills thanks to creating all the quests system. Furthermore, I also learned how to work inside a big development team. Being efficient, communicative and even being able to organize little scrum teams. This project helped me to decide that my goal inside this industry is to become a great technical designer, focusing my efforts into Level, Enemies, and Combat design. I could also be a gameplay programmer.",
        "contributions": {
          "1": {
            "title": "Quest System",
            "text": "After doing all my work on Design, I helped the team doing programming tasks. And the main task I did here was the Quest System. After coding all the system, I also implemented and tested all the game quests.",
            "media": ["../people/Adrian/Quest_System.png"]
          },
          "2": {
            "title": "Enemies & Boss Design",
            "text": "My main role during all the project has been designing all the enemies that the player will face during the game (4 enemies). Moreover, I’ve also been working on the Boss design with some teammates. ",
            "media": [
              "../people/Adrian/Enemy1.png",
              "../people/Adrian/Enemy2.png",
              "../people/Adrian/Boss.jpg"
            ]
          },
          "3": {
            "title": "Control Mapping",
            "text": "I’ve also helped designing two different sets of control mapping (Keyboard and Mouse). One based on Partisans 1941 Controls and other based on Shadow Tactics Controls",
            "media": ["../people/Adrian/Control_Mapping.jpg"]
          }
        }
      },
      "albert": {
        "rol": "Game/UI Designer",
        "overview": "As a game designer I was first tasked with analyzing tactical combat implemented in various games. I documented some of the games that were supposed to be similar to the one we were tasked to develop. I helped with audio design and made the audio bible. I was one of the main designers for the UI and UX of the game. Later on in the project I switched to the Code department to help with the cinematics. I express my gratitude and joy to be able to help develop this game. I am proud of the work done.",
        "contributions": {
          "1": {
            "title": "Audio Design & Audio Bible",
            "text": "On the Vertical Slice 2, I was asked to make an extensive list of most of the audios that will be in the game. The purpose of this list was to make the Art department able to know which audios they had to search for.<br />Later, on the Alpha 3 release, we detailed all the audio on an Audio Bible while working with the Art Lead, Carles Garriga.",
            "media": [
              "../people/Albert/audio_list.png",
              "../people/Albert/audio_bible1.png",
              "../people/Albert/audio_bible2.png"
            ]
          },
          "2": {
            "title": "UI & UX Design",
            "text": "I was the main UI and UX designer for Dune: Femen’s Rising. I was tasked to help design the UI in the early stages. Then I took over from there and started to design and create the needed UI elements.<br />Some short list of the elements designed:<br />Dialogue Box, Win/Lose Scenes, Options Menu, Main Menu, Character HUD, Ability HUD and animation and Journal Tab.<br />All these elements were listed in a document where I detailed the behavior of each button and interaction.<br />From here, I want to express my gratitude to some people I’ve worked with along the project:<br />Oscar Canales and Unai Diaz were the code team that programmed the entire UI.<br />Ismael Tejada (our Design Lead), Pau Motta (who designed some of the UI in early stages) and all the Design department that helped with the iterations providing valuable feedback.",
            "media": [
              "../people/Albert/level_completed.png",
              "../people/Albert/ability_gif.gif",
              "../people/Albert/char_hud_gif.gif",
              "../people/Albert/journal_gif.gif",
              "../people/Albert/main_menu.png"
            ]
          },
          "3": {
            "title": "Code: Cinematics Scripting",
            "text": "During the Beta and Gold releases, I switched from the Design department to the Code department in order to help with the cinematics setup. For the Beta we set up all the cinematics, but later for the Gold release, some changes were made and we were forced to mostly recreate them.<br />I was tasked with Cinematic 4, where Rabann argues with a villager and Stilgar, along with Lady Jessica, confronts him on the main Square of the city. This is the mid cinematic during the second level. It finally got canceled.<br />So then I helped with the Cinematic 3 to get it ready for the release.",
            "media": ["../people/Albert/cinematic3_1.png"]
          },
          "4": {
            "title": "QA Testing",
            "text": "Since the cinematic I was in charge got canceled, I got some time to participate in the playtesting sessions before the Gold release to help polish the game by finding bugs and writing them down on a document to help the Code team track them down.",
            "media": ["../people/Albert/qa_1.png", "../people/Albert/qa_2.png"]
          }
        }
      },
      "arnauu": {
        "rol": "Designer",
        "overview": "During these last months I have been working, mainly, as a designer, although I have also worked as an artist. That’s why during game creation I’ve been able to work in different fields. Like the whole design team, I have tried to have everything I needed to do quickly so I could help in whatever way I could. The main fields I’ve been working as a designer are Core Game Pillars, audio, NPC dialogues, animations and feedback. As an artist I’ve been into animations.",
        "contributions": {
          "1": {
            "title": "Core Game Pillars",
            "text": "",
            "media": [
              "../people/Arnauustrell/GamePillars1.png",
              "../people/Arnauustrell/GamePillars2.png"
            ]
          },
          "2": {
            "title": "Audio Analysis",
            "text": "Firstly, I did an analysis of Dune and other analysis of other games, similar to ours, of music and all kinks of audio that might be at our game or that might interest us.",
            "media": [
              "../people/Arnauustrell/audioAnalysis1.png",
              "..c/people/Arnauustrell/audioAnalysis2.png"
            ]
          },
          "3": {
            "title": "List of  All Audios and Environmental Music",
            "text": "I’ve put together the extensive list of audio and ambient music that we’ve put into the game and provided all the necessary feedback for them.",
            "media": ["../people/Arnauustrell/audios.gif"]
          },
          "4": {
            "title": "NPC dialogues",
            "text": "I have done some research among other videogames and I’ve created the most appropriate dialogues of our game from all NPCs in spanish and english (both allies and enemies).",
            "media": ["../people/Arnauustrell/dialogues.gif"]
          },
          "5": {
            "title": "Animation list and Cinematic Animations",
            "text": "Like audio, I’ve put together the extensive list of animations and list of cinematic animations that we’ve put into the game and provided all the necessary feedback for them.",
            "media": ["../people/Arnauustrell/animatonsGif.gif"]
          },
          "6": {
            "title": "Animations",
            "text": "Finally, I took care of different animations, especially some animations of Chani and some animations of other characters and enemies that were needed. Also, I was in charge of the Cinematic Animations of Chani, Stilgar, Lady Jessica and Sardakaur enemy.",
            "media": ["../people/Arnauustrell/animations.png"]
          }
        }
      },
      "enric": {
        "rol": "Narrative director",
        "overview": "My focus when working on this project has been to take care of the narrative and the consistency of our work with the Dune universe, taking into account both Frank Herbert's novels and Dennis Villeneuve's final film for the same franchise in 2021 as well as reading extensive 200+ page Lore documents. Working with my team has been a myriad of challenges, a lot of hours of intense work and has certainly given me a closer perspective on how the industry works and is something I will never forget. Everything with this team has been an incredible experience that sometimes I can't quite process. How the department has worked in sync and how I have been able to manage my skills in communicating with the other departments and do my best to get the job done in the most effective way possible.",
        "contributions": {
          "1": {
            "title": "Concept discovery",
            "text": "In anticipation of writing and narrating the story for our videogame, I spent several days researching the Dune universe in multiple aspects, from symbology and politics to astronomy, botany and science in the universe of this great IP, as well as obviously watching the movies and several chapters of some series that have been made about it.",
            "media": ["../people/Enric/DUNE.jpg"]
          },
          "2": {
            "title": "Level & Enemy Design",
            "text": "Together with Pol Vazquez, Marc Pavón and Isaac Colomer, according to my research to carry out the narrative, I helped my teammates with the level design in order to make it have a narrative sense and find a way to make meaningful the mechanical challenges posed by a RTT based also on the narrative aspect of our game.<br />Concerning the enemy design, I advised the artists on the guidelines for the enemy costumes design and the boss design with the artists David Lira, María Garrigolas and Carles Garriga.",
            "media": [
              "../people/Enric/Mapa_de_dialogos_level_2.png",
              "../people/Enric/Enemy_2_Art.png"
            ]
          },
          "3": {
            "title": "Narrative Script",
            "text": "Together with my lead designer Ismael Tejada and my partner Marc Ruiz, I wrote the narrative script of our game, which would later be used by several voice actors to make the cinematics of the project in the recordings where I co-directed the actors based on the interpretation we thought best of this script, with Himar Bravo in charge of the recording.<br /><br />This script has also come to life in written form in-game, either as subtitles for cinematics or conversations that are merely text, all thanks to the system that Mario Hernandez and Carlos Megía programmed from code.",
            "media": ["../people/Enric/Narrative_script.JPG"]
          },
          "4": {
            "title": "Team Twitter",
            "text": "During the last stages of development, although it is not the work on which I have been more focused and I think I would have done a better job starting since we were given the assignment, I have covered the publication of several of the events and the day to day of our team via Twitter as a small and fictitious way to promote our work in social networks.<br /><br />It's a job that requires a little daily dedication and the creation of content to upload to show what we do. Although I have not been able to keep up, with the knowledge acquired during the course I know that I could make a promotion up to the effort that my teammates invested in our game.",
            "media": ["../people/Enric/twitterlogo.png"]
          }
        }
      },
      "isaacc": {
        "rol": "Designer",
        "overview": "I'm really proud of what we have achieved as a team and of what I've learned as a designer. At first, I was really skeptical about the RTT genre because I had never played one before and I knew nothing about how they work. As we started doing the project, I started to see and understand the different mechanics of this type of game and especially how their levels work. I have always liked to know how the levels work and what tools are used to make players go where the designers want them to go or see, and understand what they have thought, in this project I have been able to see that this work is very complicated and that it is necessary to iterate many times to end up with a fun and functional level. Finally, I want to say that I really enjoyed doing this project and I consider it an important subject if we want to end up being developers of video games.",
        "contributions": {
          "1": {
            "title": "Level Design",
            "text": "As part of the Level Design Team, I’ve been in charge of doing all the block outs and hand design of all the levels, as well as all the enemies positioning and their respective patrols. Checking if the narrative aspect of the game was coherent with the design of our levels."
          },
          "2": {
            "title": "Level 1",
            "text": "For level 1 I have helped to make the hand prototypes of the level as well as the layout of the enemies. I have also participated in all the iterations we have done of this level.",
            "media": [
              "../people/IsaacColomer/lvl1.png",
              "../people/IsaacColomer/lvl1.gif"
            ]
          },
          "3": {
            "title": "Level 2",
            "text": "In level 2 I have made different prototypes of the level. On the other hand, I have made the final version of it. I have also collaborated in the assembly of the level, adding the enemies and iterating everything we have been doing.",
            "media": [
              "../people/IsaacColomer/lvl2.gif",
              "../people/IsaacColomer/concept_lvl2_1.png"
            ]
          },
          "4": {
            "title": "Level 3",
            "text": "For level 3 I have been in all the design phases of the level and I have been in charge of placing the enemies. On the other hand, I have helped with the design of the boss and I have helped to create the boss battle zone.",
            "media": ["../people/IsaacColomer/lvl3.gif"]
          },
          "5": {
            "title": "Level Prototyping",
            "text": "We did a Unity build to test the first level and the abilities of the character. We also did some early enemy AI to test how they would react to the player actions."
          },
          "6": {
            "title": "Playtest",
            "text": "We needed to know which errors our game had, and I was one of the participants of the playtesting sessions we held at the center. I also helped to organize the in class playtesting sessions, which were really helpful because we hadn’t had the opportunity to test the whole game and lots of design errors came from those sessions."
          },
          "7": {
            "title": "Extras",
            "text": "- Design of the intro scene screen.<br />- Prop List: I did a prop list for all the levels.<br />- Game Balance: After the testing sessions, I helped to balance the abilities cooldown and the enemies position and patrol.<br />- Level Design: I did the concept discovery of some RTT games level design.<br />- QA: Lots of testing!",
            "media": ["../people/IsaacColomer/mainMenu.png"]
          }
        }
      },
      "marcp": {
        "rol": "Designer",
        "overview": "As a member of the Design team I’ve been working from the early discovery and concepts to the final polishing of the game. It’s been an incredible learning experience, where we all learned how to team up and tackle the constant adversities we found along the way. And at the end of the road I realize the hard and marvelous job that all the departments have achieved. Personally, I’ve learned to work as a team in a professional environment, whether it be seeking help or giving it when needed, distributing tasks, guiding the team and keeping track of the work as Scrum Master, being more critical with myself and accepting others' criticism. As well as foundations for level, enemy, character design and the effort it takes to iterate countless times to get them as close to perfect as possible.",
        "contributions": {
          "1": {
            "title": "Level Design",
            "text": "Designed the concepts of all the levels, terrain distribution, enemies positioning and patrols, interactable objects, narrative triggers and characters and abilities progression through them, and pacing. Building the blockouts and iterating with the playtesting feedback paired with Isaac Colomer.",
            "media": [
              "../people/MarcPavon/lvl1.png",
              "../people/MarcPavon/lvl1Gif.gif",
              "../people/MarcPavon/lvl2.png",
              "../people/MarcPavon/lvl2Gif.gif",
              "../people/MarcPavon/lvl3.png",
              "../people/MarcPavon/lvl3Gif.gif"
            ]
          },
          "2": {
            "title": "Playtesting",
            "text": "Organized several in class playtest sessions and a presencial playtest at CITM Terrassa open to all students with more than 30 participants where we discovered several bugs, some crashes, design problems and lack of in game feedback, among others.",
            "media": ["../people/MarcPavon/coninue.png"]
          },
          "3": {
            "title": "Boss Design",
            "text": "Worked on the Rabban boss concept, design and diverse iterations, dividing him in phases or hits. Designed the first, second and third phase, arena distribution and defined the exploding barrels mechanic.",
            "media": [
              "../people/MarcPavon/Boss_design.PNG",
              "../people/MarcPavon/Rabban.PNG"
            ]
          },
          "4": {
            "title": "Player and enemy prototyping",
            "text": "Prototyped the first level on Unity. With the player base movement and first ability (stone) with basic enemies with vision range to test the sizes, speeds, timings and interaction between player and environment.",
            "media": ["../people/MarcPavon/Unity.PNG"]
          },
          "5": {
            "title": "Level 3 Decoration",
            "text": "Added decoration from already made props from art to level 3. The Level was floating on the void, added terrain, houses, and rocks with Maya, implemented and textured them on the Engine.",
            "media": [
              "../people/MarcPavon/No_decoration.PNG",
              "../people/MarcPavon/With_decoration.PNG"
            ]
          },
          "6": {
            "title": "Minor Stuff",
            "text": "Interactable Objects: Concept Discovery of interactable objects. <br />Audio Feedback: Audio implementations on the early iterations of the game.<br />Characters Design: Abilities, movement options and sound area defined on early stages.<br />Enemies behavior: Design of different enemies behaviors needed to be implemented.<br />Props List: Defined different props list on each level for art to make.<br />Difficulty Balance: The feedback the playtesting gave us made us realize the game was too hard, so we reduced cooldowns on players abilities and reduced the number of enemies on some zones.<br />QA: Finding and reporting bugs."
          }
        }
      },
      "marcru": {
        "rol": "Designer",
        "overview": "As a member of the design project I have made a lot of impactful throughout the development of the game, my contribution for this game has been made in a wide range such as abilities, narrative and marketing. So everywhere I was I tried my best to ensure the game received the best quality I could add. Working with my classmates has been an enriching experience that I will carry on for my future as I learnt a lot about working with a team. I have been a scrum master thrice and leading my team has been an amazing journey with a great result that I’m proud to be part of.",
        "contributions": {
          "1": {
            "title": "Stealth mechanics and skill tree",
            "text": "At the start of the development I was assigned to study the stealth mechanic from a wide range of video games, especially from our genre, then I was asked to make a skill tree for the game, which I did, with all the unlockables and ways to unlock the skills, but it was finally canceled due to not having enough time to implement it.",
            "media": ["../people/MarcRuiz/stealth.gif"]
          },
          "2": {
            "title": "Iteration of abilities",
            "text": "During the course of the development, I was told to make a second iteration of the abilities of the game, which I did for all three characters alongside a member of my team. We balanced all the abilities, changed a few, and added new ones to make the game feel more polished. We even made an achievement system which would reward better abilities and a progression system for the game.r",
            "media": ["../people/MarcRuiz/abilities.gif"]
          },
          "3": {
            "title": "Marketing",
            "text": "I made a few spotlights for characters in-game for youtube and TikTok, which were made of an early build of the game. Later I made the trailer for the final game.<br />Also I made a documentary about the making of the video game, which consisted of interviews with the leads and a few members of the team that explained their points of view about this project. Currently the documentary is in development and will be released soon but there is a trailer about it which you can watch now on youtube.",
            "media": ["https://www.youtube.com/watch?v=psQ3VnADBAI"]
          }
        }
      },
      "max": {
        "rol": "Designer",
        "overview": "I'm Max Llovera and I've been working as a designer for Dune: Fremen's Rising. As a member of the design team I've been able to work in different fields across the development of the game, always focusing on creating the perfect experience for the player, making sure that the final product has a good consistency and the highest quality. Later, at some point of the development, I switched to the Art Department to help them in some fields like animations or UI elements. I really enjoyed working in different departments and getting experience with both of them. Being part of this project has been a wonderful experience for me and all the team, I'm so proud to be part of this.",
        "contributions": {
          "1": {
            "title": "Character Design (Skills and Rune System)",
            "text": "During the development of the game, I designed the abilities for each character of the game. First of all I designed some abilities without assigning it to a specific character, and finally I distributed it to the 3 different characters taking into account their gameplay and synergies between them.<br />Apart from the abilities, I designed a Rune system, bringing new power ups to the basic abilities of each character, which makes a good progression system to the gameplay of the game. Unfortunately, it couldn’t be implemented into the game.",
            "media": ["../people/MaxLlovera/Gif_HAbilities.gif"]
          },
          "2": {
            "title": "Design of Enemy behavior and dynamics between Characters and Enemies",
            "text": "As I was the character designer for abilities and skills, I designed all the behaviors and dynamics between enemies and characters, taking into account all the abilities and how they work.",
            "media": ["../people/MaxLlovera/Behaviour.gif"]
          },
          "3": {
            "title": "Audio Document",
            "text": "Detailing as much as I could all the different audios needed for the game and its correct feedback. Checking with Audio Designer that all the sounds were good and understandable for the player.",
            "media": ["../people/MaxLlovera/AudioDocument.gif"]
          },
          "4": {
            "title": "Fx and Particles Document",
            "text": "As I did with the audio document, here I detailed all the FX and Particles we needed to implement into the game to offer a nice experience to the player.",
            "media": ["../people/MaxLlovera/Particles.gif"]
          },
          "5": {
            "title": "Boss Design Document",
            "text": "Together with Boss Design team, detailing as much as I could about all the boss fight and how to defeat it. Describing each phase in detail and how to change between phases, all boss behaviors between him and the characters. Finally, iterating and changing some gameplay features for a great experience for the player.",
            "media": ["../people/MaxLlovera/BossDocument.gif"]
          },
          "6": {
            "title": "Feedback documents",
            "text": "Giving feedback to the player is crucial for an enjoyable experience when playing a video game. I started with a first feedback draft document for all the visual and auditive feedback needed for the Alpha version. Then I finished the document for the final gold version of the game of all the missing feedback after testing the game."
          },
          "7": {
            "title": "Characters and Cinematic Animations",
            "text": "As the Art team needed help, I did Paul Atreides, Enemy 1 and 3 animations. Then I did some character animations for cinematics, such as Paul, Rabban, Hostages, Harkonen Soldier and Undistractable Harkonen Soldier. Finally, I did both Victory and Defeat animations which appear at the end of each level.",
            "media": [
              "../people/MaxLlovera/Animations.gif",
              "../people/MaxLlovera/Animations2.gif"
            ]
          },
          "8": {
            "title": "UI Elements",
            "text": "I help the UI team doing some elements needed for a perfect gameplay experience and for a correct feedback. Some elements are the boss life and shield bar, pop-ups for the abilities and enemy stun icon.",
            "media": ["../people/MaxLlovera/UI_ELEMENTS_web.JPG"]
          },
          "9": {
            "title": "QA",
            "text": "Doing testing and QA sessions, spotting bugs and reporting to the Code team",
            "media": ["../people/MaxLlovera/QA.png"]
          }
        }
      },
      "pau": {
        "rol": "Designer/UI Designer",
        "overview": "This work has been able to teach me first-hand to have an experience more or less similar to what I could find in a video game company. Thanks to this, I have been able to learn how teams work and what works dynamics there are and which ones usually succeed. In addition, I have been able to observe through the dynamics made for a correct functioning of the team how these influence the work of the rest of the group's participants and what their needs were.",
        "contributions": {
          "1": {
            "title": "UX  Designer",
            "text": "For this design iteration of the HUD, we have chosen to go with DUNE's typography-based design. This is because it was the one that came closest to the objectives that were set at the beginning before making this design, these were the simplicity of this design and the closeness it has with the film.",
            "media": [
              "../people/Pau/UXDesign1.png",
              "../people/Pau/UXDesign2.png",
              "../people/Pau/UXDesign3.png",
              "../people/Pau/UXDesign4.PNG"
            ]
          },
          "2": {
            "title": "Group dynamics moderator",
            "text": "I have been organizing some class sessions dedicated to generating a better work environment and explaining the needs that each of the departments had for the correct functioning of the team, I have also been able to learn first-hand which dynamics work and which do not.  Thanks to the iteration of these practices I have been able to adapt to the needs of the group.",
            "media": ["../people/Pau/Dynamics.png"]
          },
          "3": {
            "title": "Playtesting",
            "text": "I was responsible for the creation of the tests for the playtest, in addition to helping with the dynamization and the creation of an optimal environment to carry them out."
          }
        }
      },
      "polv": {
        "rol": "Designer/Artist",
        "overview": "During this project, I’ve played different roles during the project, alternating between the Design and the Art departments. My part during this project was primarily focused on Boss Design, while also helping with Level Design with the blockouts. During the middle of the project, we needed some help in art, so I switched to the Art department to help. When I was in art, I helped with the animations, but mainly I focused on level 2. I did some props, all of the houses and the city wall. Lastly, I put it all together and made the final touches to the 2nd level. In the final milestones I helped in the gameplay feedback and polish of the game. It was a lot of fun and helped me decide that I want to become either a Level Designer or a 3D Environment artist.",
        "contributions": {
          "1": {
            "title": "Boss Design",
            "text": "Even though I wasn’t in the last iteration of the boss, I made the first approach of how we wanted the boss to be, according to what we had and what we wanted to achieve. We followed the 7 pulses theory to design this boss, and we also designed the boss room for the fight.",
            "media": ["../people/PolVazquez/Rabban.PNG"]
          },
          "2": {
            "title": "Levels Blockout",
            "text": "I developed all of the levels blockouts to help the designers see what the level was gonna look like and the coders so they could start testing things out.",
            "media": [
              "../people/PolVazquez/lvl1_blockout.PNG",
              "../people/PolVazquez/lvl2_blockout.PNG",
              "../people/PolVazquez/lvl3_blockout.png"
            ]
          },
          "3": {
            "title": "Level 2 Props & Textures",
            "text": "I helped with the small prop list of the level 2, and later on I modeled all of the houses of the level, along with the wall and its textures.<br />Finally I put it all together and created the final version of level 2. It was a huge upgrade and 1 month of optimizing, remodeling and re-doing some of the houses to fit in our engine. In total, I managed to get 35k of polys, with a total of 84 houses (just 13 of these are different models). I scaled, rotated, added and removed props so any of the houses feel repetitive. By far, the thing I'm most proud of during this project.",
            "media": [
              "../people/PolVazquez/lvl2props.PNG",
              "../people/PolVazquez/mercattrencat.png",
              "../people/PolVazquez/lvl2.png",
              "../people/PolVazquez/lvl2finished.PNG",
              "../people/PolVazquez/lvl2textures.PNG"
            ]
          },
          "4": {
            "title": "Minor Stuff",
            "text": "- Enemies first iterations: First approach on what class of enemies the RTTs have and what mechanics could be interesting.<br />- Enemies animations & fixing: Animations of some enemies along with fixing some of the animations.<br />- First Win-Lose scene iterations: First iterations of the scenes, currently deleted but useful in the first steps of the game.<br />- Main Menu Screen iterations: First iterations of the screen, currently deleted but useful in the first steps of the game.<br />- Boss Level Design: Designed the boss room and imported it to Blender to test it.<br />- QA & Playtesting: Searching and reporting bugs and crashes.",
            "media": ["../people/PolVazquez/dunes_rising_winscene.png"]
          }
        }
      },
      "alex": {
        "rol": "2D&3D Artist/Animator",
        "overview": "I am Alex Gesti Fernández, a video game development student at CITM and a graduate in 3D animation, games and interactive environments. In this project I have worked in the Art group as a 3D Animator, 2D VFX Artist and Modeler of some props using Maya, Blender, Photoshop and After Effects. Dune Fremen's Rising was an incredibly difficult job as a 3D animator, since we worked with our own engine and it was being developed while the Art team was working on the game and sometimes it was not known how the animations developed in the engine would work.  Despite this, it has been an entertaining and lucrative experience to learn to work in a group and improve my 3D skills.",
        "contributions": {
          "1": {
            "title": "3D Animator",
            "text": "In this project I have been working as the main 3D Animator of the characters, the enemies and the boss, having some animations that were taken from Mixamo and others made from scratch by hand.<br /><br />In general, animations with interpolation have been worked on, but others have worked with animations made frame by frame.",
            "media": [
                "../people/Alex/3DAnimator/1.gif",
                "../people/Alex/3DAnimator/2.gif",
                "../people/Alex/3DAnimator/3.gif"
            ]
          },
          "2": {
            "title": "2D VFX Artist",
            "text": "During half of the development I have worked on the VFX sprites of the game, developing them all in After Effects.<br /><br />These have been made from scratch with different effects available in the application, some being simple and not covering many frames, and others being complex and with a large number of frames.<br /><br />After finishing them, these animations had to be transformed into sprite sheets so that the code team could implement it.",
            "media": [
              "../people/Alex/2DVFXArtist/1.gif",
              "../people/Alex/2DVFXArtist/2.gif"
            ]
          },
          "3": {
            "title": "3D Modeler",
            "text": "While I was developing some animations, the 3D Modelers team needed help with some materials, so I took a moment to develop some models.<br /><br />These models were a blinder, which was made a version with holes, which was made a normal map and implemented in a more low poly model, and a stone, which was made a high poly and then made a retopology.",
            "media": [
              "../people/Alex/3DModeler/1.png",
              "../people/Alex/3DModeler/2.png"
            ]
          }
        }
      },
      "davidl": {
        "rol": "Artist",
        "overview": "I am David Lira Martí, a Videogame Development student who loves art and videogames. On this project I worked as a Concept Artist and Modeler for some of the props and characters. Dune Fremen’s Rising was a real challenge for the team and myself, I think that during the development I learned several things about video game development as an artist. Despite some difficult moments we managed to finish a cool game on time with some created from 0 with our own engine. I think it is quite amazing what we managed to do by ourselves in such little time of development. It was nice and educational working on this project with my classmates and is an experience I will always remember.",
        "contributions": {
          "1": {
            "title": "Concept / HUD Art",
            "text": "At the start of the project I was assigned to do some Concept Art for the characters in the game, some of them like Chani and Paul were included in the game as playable characters but others like Vladimir Harkonnen were discarded game content.<br />I also was the artist who made the portraits for the game, they appear on the conversations and the HUD, they needed to have little detail because of the ingame size of the portrait.",
            "media": [
              "../people/DavidLira/PaulAtreidesConcept.png",
              "../people/DavidLira/ChaniConceptFinal.png",
              "../people/DavidLira/VLADIMIRHARKONNENFINAL.png",
              "../people/DavidLira/portraits.png"
            ]
          },
          "2": {
            "title": "Enemy / Boss and Other Models",
            "text": "These are some of the models I created for the game. I was focused mainly on the enemies models, but I also created other ones. On the first image you can see the first enemy I created, it was to be changed because of the poly count and art style of the game, so the next ones were more low poly and had different body proportions.",
            "media": [
              "../people/DavidLira/EarlyEnemy.PNG",
              "../people/DavidLira/Enemies.PNG",
              "../people/DavidLira/Dron.PNG",
              "../people/DavidLira/Boss.PNG"
            ]
          },
          "3": {
            "title": "Some Level 3 Props",
            "text": "I also worked on some of the level 3 (palace level) props, these are the ones I worked on, they are low-poly because of the engine limitations, but they look great in game because of the camera distance and the cell shading of the engine.<br />In addition I was the person who put together all of the props in order to create the final map, I also improved the level 1 creating a better atmosphere with the background rocks.",
            "media": [
              "../people/DavidLira/props.PNG",
              "../people/DavidLira/props2.PNG",
              "../people/DavidLira/props3.PNG"
            ]
          }
        }
      },
      "marcra": {
        "rol": "Artist",
        "overview": "As a member of the art team, my duty in this project was to create the art of the levels alongside other artists. During the project I have been modeling and texturing props and environments based on the art style of the game and optimizations given the engine guidelines.",
        "contributions": {
          "1": {
            "title": "Level 1 Art",
            "text": "I was responsible for the creation and optimization of level 1. Main environment such as rocks, sand… And decoration props.",
            "media": [
              "../people/MarcRamos/Captura.png",
              "../people/MarcRamos/rocas.png",
              "../people/MarcRamos/screenshot000.png"
            ]
          },
          "2": {
            "title": "Texturing level 2 and level 3",
            "text": "I was responsible for the material creation for the main buildings and structures of the second and the third level.",
            "media": [
              "../people/MarcRamos/RefA.png",
              "../people/MarcRamos/RefA_2.png",
              "../people/MarcRamos/Captura3.png"
            ]
          }
        }
      },
      "maria": {
        "rol": "Artist",
        "overview": "As a member of the art department, my main role within the art team has been texturing, drawing concepts, some modeling and helping other art branches such as animation. This project has been an incredible journey and an amazing rollercoaster.I will cherish every moment of it, since it’s the first big project I’ve taken part of and got to learn many things that will for sure make a difference in my future career, not only as a game developer but as an individual.",
        "contributions": {
          "1": {
            "title": "Concept Art",
            "text": "First of all, we needed to have a visual reference or representation of how the different characters would look like. These are some of the turnarounds that were made in order to ease the modeling process.",
            "media": [
              "../people/Maria/Concepts/char_stilgar_art.png",
              "../people/Maria/Concepts/enm_boss_art.png",
              "../people/Maria/Concepts/enm_enemy4_art.png",
              "../people/Maria/Concepts/nme_enemy3_art.png"
            ]
          },
          "2": {
            "title": "Characters and enemies",
            "text": "Once the modeling was done, we had to proceed to texturize them. These are the characters and their abilities with their respective textures. Substance was the main software used for the textures. The only channels that were used are base color and normal map. Also I had to do some last minute modeling on the abilities part, because stilgar’s trap was missing.",
            "media": [
              "../people/Maria/Characters/chars.png",
              "../people/Maria/Characters/abilities.png"
            ]
          },
          "3": {
            "title": "Cinematics characters textures",
            "text": "Also, I was in charge of the cinematics characters textures: the male and female hostage and Lady Jessica.",
            "media": ["../people/Maria/Cinematics/cinematicschars.png"]
          },
          "4": {
            "title": "Props",
            "text": "I was in charge of texturing these props that belonged to level 2 and level 3. Again, the software that was used was Substance and the only channels were base color and normal map.",
            "media": ["../people/Maria/Props/Props.png"]
          },
          "5": {
            "title": "Other",
            "text": "Also, I lent a hand anytime my teammates had a hard time finishing on time their tasks, such as helping on the animation part with Stilgar character animations."
          }
        }
      },
      "oscarr": {
        "rol": "Artist",
        "overview": "This project has been a lot of fun and even with some problems that we had I liked it a lot and think the final result is great. Having the opportunity to work as if it was a real studio and the possibility to work in what I like the most has been an incredible experience that I'll always remember.<br />As a member of the art team, my main role in the project has been 3D modeling. Throughout the project, I have been in charge of modeling some of the characters and many assets that appear in the game. Also made some textures and animations.",
        "contributions": {
          "1": {
            "title": "Concept for Level 2",
            "text": "My first important work was researching and creating a concept for the second level. I searched for the ambience, the look of the buildings and the props. I also developed the prop list that later needed to be extended.",
            "media": [
              "../people/OscarRoyo/environmentscene2conceptmoodboard.png",
              "../people/OscarRoyo/environmentscene2conceptmoodboard2.png",
              "../people/OscarRoyo/environmentscene2conceptmoodboard3.png"
            ]
          },
          "2": {
            "title": "Character Models",
            "text": "I made the high poly and low poly versions of the three main characters: Paul, Chani and Stilgar. We had a pretty small polycount limit so I had to work with the texture artist to give them the maximum amount of detail with the least amount of polygons.",
            "media": [
              "../people/OscarRoyo/stilgargif.gif",
              "../people/OscarRoyo/Paul_Model_Gif.gif",
              "../people/OscarRoyo/Chani_Model_Gif.gif"
            ]
          },
          "3": {
            "title": "Props",
            "text": "I made a lot of props for this game, the models and the textures. Like with the characters I tried to keep the polycount very low.<ul><li>Barrels</li><li>Bullet holes</li><li>Barricade</li><li>Columns</li><li>Antenas</li><li>Fruit boxes</li><li>Cables</li><li>Street lamp</li><li>Anti worms</li><li>Ground hole</li></ul>",
            "media": [
              "../people/OscarRoyo/Captura.PNG",
              "../people/OscarRoyo/nuevosassets.jpg"
            ]
          },
          "4": {
            "title": "Particles",
            "text": "I investigated the different types of particles that could be used in our game and I had to make some of them too. Since our particle system is pretty extensive I checked the behavior with unity and worked with the particle system coder to make them look like the design team wanted.",
            "media": ["../people/OscarRoyo/Particles.png"]
          },
          "5": {
            "title": "Animations",
            "text": "I helped with some of Chani’s animations and also worked in the animations for the menu, win and lose screens. This was really hard because some of the animations didn’t seem to work in our engine so a lot of iterations were needed to make them work.",
            "media": ["../people/OscarRoyo/ezgif.com-gif-maker.gif"]
          },
          "4": {
            "title": "Textures",
            "text": "Apart from the textures of my props I also made some textures for some abilities of the characters and for the high poly models in the menu. The faces were a pretty difficult challenge to me and I spent a lot of time on them.",
            "media": ["../people/OscarRoyo/wpn_paul_eagle_BaseColor.png"]
          }
        }
      },
      "polp": {
        "rol": "UI/Sound artist",
        "overview": "As a member of the art team I've been involved with the UI from the very beginning until its redesign in the end, where my attention was captured by the cinematic design in which I defined every animation for every character under the approval of Enric Morales, the owner of the script. Between these two focuses I’m also responsible of the search of all audio in game, except the new music by our external composer, again thanks to the supervision of Max from the design team. I also worked in few animations for the enemies and others in the cinematics at the very beginning. I’m glad that the design team has let me do these jobs while I worked at the art department as design is my true passion in video games. Here is my linkedIn as I’m open to work in any design/art team: https://www.linkedin.com/in/pol-pallares-mur-4a5729226/",
        "contributions": {
          "1": {
            "title": "UI Artist",
            "text": "As a UI artist I worked on different sketches throughout the game such as the skill icons, a set of two textures that were subsequently discarded, various UI icons and elements and finally I worked on photoshop and later on in blender for the first and second sets of backgrounds for the main menu and loose screen. I also worked on a sketch for the game logo later changed by the art’s lead.",
            "media": [
              "../people/PolPallares/all_at_once.png",
              "../people/PolPallares/primera_iteracion_iconos_ui.png",
              "../people/PolPallares/segunda_iteracion_iconos_ui.png",
              "../people/PolPallares/ui_mainmenuBG_png.png",
              "../people/PolPallares/ui_losescreen.png"
            ]
          },
          "2": {
            "title": "Sound Artist",
            "text": "In two different deliveries I worked as the sound artist searching/modifying over 130 different sounds/FX without including those discarded and some music tracks and environmental sounds. Some of the sounds are original from soundsnap but some others have been modified through audacity.",
            "media": [
              "../people/PolPallares/Captura2.PNG",
              "../people/PolPallares/Captura3.PNG"
            ]
          },
          "3": {
            "title": "Cinematic Design",
            "text": "In the last deliveries I’ve been part of the cinematics team defining every animation and cinematic that should appear in-game, some personal problems didn’t let me continue my job for 1 week where Enric organized the group redefining the cinematics as the system was prepared for 7 cinematics and not for 13 as I had planned out but the script ended up fitting into those 7 cinematics perfectly. At the beginning I also worked finding some first animations for an example for the cinematics and evey animation was listed in a set of excel pages such as in the following image.",
            "media": ["../people/PolPallares/Captura.PNG"]
          }
        }
      }
    },
    "game": {
      "title": "Juego",
      "text": "Ayuda a Paul Atreides a liberar Arrakeen del yugo de los Harkonnen después de que estos ataquen a los Fremen, su nueva familia, que habita los cañones y cuevas del desierto. Distrae, elimina o aturde a los soldados Harkonnen para abrirte paso entre sus filas hasta encontrar y eliminar a su líder, Rabban Harkonnen, uno de los caudillos del emperador."
    },
    "production": {
      "title": "Producción",
      "card1": {
        "text": "Siguiendo el método ágil se aplicaron varios de sus elementos como son los equipos de scrum o los stand-ups. Esto nos permitió organizarnos mejor y ayudó a la comunicación entre departamentos."
      },
      "card2": {
        "text": "Para organizar las tareas y loggear las horas se utilizó HacknPlan. Los stand-ups y las retrospectivas se llevaron a cabo en clase, al igual que las sesiones de playtesting."
      },
      "card3": {
        "text": "Además de las tareas que se nos asignaban a cada entrega, desde producción decidimos ir un paso más allá y oranizamos un casting para actores de voz, a parte de conseguir un compositor para la música del juego y un diseñador web. Esto permitió elevar la calidad del juego final aún más."
      },
      "subtitle1": "Métodologia Ágil",
      "subtitle2": "Organización",
      "subtitle3": "Externo"
    },
    "engine": {
      "title": "Motor",
      "subtitle": "Lorem ipsum dolor sit amet consectetur adipisicing elit. Quae, in!",
      "features": {
        "1": {
          "title": "Graphics",
          "subtitle": "Lorem ipsum dolor sit amet consectetur adipisicing elit. Quae, in!"
        },
        "2": {
          "title": "Audio",
          "subtitle": "Lorem ipsum dolor sit amet consectetur adipisicing elit. Quae, in!"
        },
        "3": {
          "title": "Physics",
          "subtitle": "Lorem ipsum dolor sit amet consectetur adipisicing elit. Quae, in!"
        },
        "4": {
          "title": "Input",
          "subtitle": "Lorem ipsum dolor sit amet consectetur adipisicing elit. Quae, in!"
        },
        "5": {
          "title": "UI",
          "subtitle": "Lorem ipsum dolor sit amet consectetur adipisicing elit. Quae, in!"
        },
        "6": {
          "title": "AI",
          "subtitle": "Lorem ipsum dolor sit amet consectetur adipisicing elit. Quae, in!"
        }
      }
    },
    "post_mortem": {
      "title": "Post Mortem",
      "sections": {
        "1": {
          "title": "Retrospectiva",
          "description": "Haciendo una vista atrás, este proyecto ha sido una de las asignaturas más importantes de la carrera, generando un nuevo elemento en nuestro portfolio y otorgándonos gran conocimiento en áreas que no habíamos visto hasta ahora"
        },
        "2": {
          "title": "Crunch",
          "description": "El crunch ha estado presente a lo largo de todo el desarrollo, pero dado el contexto del proyecto era casi inevitable. Teniendo que conllenvar Proyecto 3 con otras asignaturas ha sido uno de los retos más dificiles que se nos ha presentado."
        }
      }
    },
    "contact": {
      "title": "Contacto",
      "social_media": "Redes Sociales"
    }
  }
}
